namespace HOMEWORK_9;

class Program
{
    static void Main(string[] args)
    {
        Console.WriteLine("Homework N2");
        // შექმენით კლასები ( პარამეტრებით და მეთოდებით ) და შესაბამისი მეთოდები.
        // 2. შექმენით ორი კლასი Teacher და Student
        //     Students უნდა ქონდეს 3 პარამეტრი სახელი,ასაკი , უნივერისტეტში ჩარიცხვის
        //     წელი
        // ასევე უნდა ქონდეს 2 მეთოდიa
        // 1.რომელიც რენდომ საგანს დააბრუნებს ,
        // 2.დათვლის რამდენი წელი დარჩა სტუდენტს უნის დამთავრებამდე
        //     (დავუშვათ ჯამში 4 წელი უნდა ისწავლოს)
        //
        // Teacher უნდა ქონდეს 2 პარამეტრი სახელი და სტატუსი სერტიფიცირებულია თუ არა
        //     მასწავლებელ კლასს უნდა ქონდეს მეთოდი რომელიც მიიღებს სტუდენტისგან
        //     დაბრუნებულ
        // საგნის დასახელებას შეამოწმებს მას და დააბრუნებს პასუხს .
        //     თუ სტუდენტმა მათემატიკა აარჩია ორი რენდომ რიცხვის ჯამს გამოიტანს
        //     თუ ქიმია დაბეჭდავს რომელიმე ქიმიურ ფორმულას
        //     თუ ინგლისური ნებისმიერი ტექსტი ინგლისურ ენაზე
        //     სხვა საგნის შემთხვევაში მაგ საგანში გამოიტანს რომ არ არის კომპეტენტური ამ
        // საგანში.
        
        
        Student student = new Student("Nika", 19, 2024);
        student.Display();
        student.UniGraduation();
        student.RandomSubject();
        Teacher teacher = new Teacher("Wolfgang", true);
        teacher.Check(student);
        teacher.DisplayInfo();
        Console.WriteLine();

        
        // 1. დაწერეთ პროგრამა რომელიც დათვლის კომპანიის მიერ გადახდილი ჯამურად
        //     გადახდილი ხელფასიდან რამდენი მიდის სახელმწიფო გადასახადებში .
        //     შექმენით კომპანიის კლასი(Company) რომელსაც აქვს 1 პარამეტრი რომელიც
        // განსაზღვრავს ადგილობრივი კომპანიაა თუ უცხოური ასევე ერთი მეთოდი რომელიც
        //     ამოწმებს თუ ადგილობრივი კომპანია მაშინ ჯამურად გადახდილი თანხის 18 %
        //     გადაირიცხება ბიუჯეტში თუ უცხოური კომპანიაა მაშინ 5%
        //
        //     შექმენით თანამშრომლის(Employee) კლასი რომელსაც ექნები შემდეგი პარამეტრები
        //      სახელი
        //      გვარი
        //      ასაკი
        //      პოზიცია( მენეჯერი,დეველოპერი,ტესტერი,სხვა ნებისმიერი)
        //      კვირის განმავლობაში ნამუშევარი საათები მაგ: 8, 8, 8, 8, 8, 0, 0
        // ექნება 1 მეთოდი რომელიც დათვლის კვირის განმავლობაში რამდენი იქნება
        //     თანამშრომლის საშუალი ხელფასი
        // გამოიყენეთ HomeWork_7 N3 დავალება
        // 1. დაწერეთ პროგრამა რომელიც დათვლის თანამშრომლის შემოსავალს 1
        // კვირის განმავლობაში .
        //     გაითვალისწინეთ
        // a. დღეში თანამშრომელი მუშაობს 8 საათს და არის მენეჯერი საათში იღებს -
        //     40$,დეველოპერი - 30$,ტესტერი-20$ სხვა ყველა იღებს 10$
        // b. ოვერთაიმის შემთხვევაში საათში იღებს დამატებით 5$
        // c. შაბათ/კვირას მუშაობის შემთხვევაში იღებს გაორმაგებულ ხელფასს
        // d. თუ თანამშრომელმა კვირაში იმუშავა 50 საათზე მეტი ეკუთვნის ბონუსი
        // ჯამური ხელფასის 20 %


        Console.WriteLine("Homework N1");
        Employee employee = new Employee("nika", "Pakhu", 19,Employee.Positions.Meneger, new[] { 8, 8, 8, 8, 8, 0, 0 });
        employee.AverageSalary();
        // Employee employee2 = new Employee("Shota", "Shala", 19, Employee.Positions.Tester, new[] { 8, 8, 8, 8, 8, 0, 0});
        // employee2.AverageSalary();
        Company company = new Company("Native");
        company.Checker(employee);
        
        //salarys ver vanaxleb
        

    }
}