namespace HOMEWORK_9;

class Program
{
    static void Main(string[] args)
    {
        // შექმენით კლასები ( პარამეტრებით და მეთოდებით ) და შესაბამისი მეთოდები.
        // 2. შექმენით ორი კლასი Teacher და Student
        //     Students უნდა ქონდეს 3 პარამეტრი სახელი,ასაკი , უნივერისტეტში ჩარიცხვის
        //     წელი
        // ასევე უნდა ქონდეს 2 მეთოდიa
        // 1.რომელიც რენდომ საგანს დააბრუნებს ,
        // 2.დათვლის რამდენი წელი დარჩა სტუდენტს უნის დამთავრებამდე
        //     (დავუშვათ ჯამში 4 წელი უნდა ისწავლოს)
        //
        // Teacher უნდა ქონდეს 2 პარამეტრი სახელი და სტატუსი სერტიფიცირებულია თუ არა
        //     მასწავლებელ კლასს უნდა ქონდეს მეთოდი რომელიც მიიღებს სტუდენტისგან
        //     დაბრუნებულ
        // საგნის დასახელებას შეამოწმებს მას და დააბრუნებს პასუხს .
        //     თუ სტუდენტმა მათემატიკა აარჩია ორი რენდომ რიცხვის ჯამს გამოიტანს
        //     თუ ქიმია დაბეჭდავს რომელიმე ქიმიურ ფორმულას
        //     თუ ინგლისური ნებისმიერი ტექსტი ინგლისურ ენაზე
        //     სხვა საგნის შემთხვევაში მაგ საგანში გამოიტანს რომ არ არის კომპეტენტური ამ
        // საგანში.
        
        
        Student student = new Student("Nika", 19, 2024);
        student.Display();
        student.UniGraduation();
        student.RandomSubject();
        Teacher teacher = new Teacher("Wolfgang", true);
        teacher.Check(student);
        teacher.DisplayInfo();


    }
}